# Semana 5: Manipulaci칩n de datos

## 游냪 Pandas

Pandas (Python Data Analysis Library) es una de las librer칤as de Python m치s populares en ciencia de datos. Proporciona estructuras de datos de alto nivel y funciones que est치n dise침adas para que el trabajo con datos estructurados o tabulares sea r치pido y f치cil. En particular, Pandas proporciona funcionalidades que facilitan la indexaci칩n, segmentaci칩n, el uso de agregaciones y mucho m치s. Dado que la manipulaci칩n y limpieza de datos son habilidades importantes en la ciencia de datos, esta ser치 una herramienta imprescindible.

In [1]:
# Llamar la libreria de pandas
import pandas as pd

## 游늵 DataFrames en Pandas
Un DataFrame es una estructura de datos bidimensional con etiquetas en filas y columnas.

In [2]:
# Construir un DataFrame a partir de un diccionario

#Declarando el diccionario de nombre "data"
data = {
    "Pais": ["Suiza", "Australia", "Canada"],
    "Capital": ["Berna", "Canberra", "Ottawa"],
    "Pob": [8.6, 25.7, 38]
}

indices = ["A", "B","C"]

#Creando el DataFrame, al que estoy nombrando como "tabla"
tabla = pd.DataFrame(data = data, index= indices)
tabla

        Pais   Capital   Pob
A      Suiza     Berna   8.6
B  Australia  Canberra  25.7
C     Canada    Ottawa  38.0

|               | Tipo en Python | Tipo en Pandas |
| :---------------- | :------: | ----: |
| String        |   `str`   | ```object``` |
| N칰mero enteros        |   `int`   | ```int64``` |
| N칰mero flotantes        |   `float`   | ```float64``` |
| Booleanos        |   `bool`   | ```bool``` |

In [6]:
print(tabla.dtypes)

Pais        object
Capital     object
Pob        float64
dtype: object

Podemos leer y escribir datos en distintos formatos.

```python
tabla.to_csv('datos_guardados.csv', index=False)
```

##  游닍 Importaci칩n y uso de paquetes
Para trabajar con archivos, Pandas ofrece funciones como `read_csv()` y `read_excel()`.

In [10]:
df = pd.read_csv('Ejemplos/Tabla_1_ejemplo.csv')

df

    ID  Producto  Precio  Cantidad
0  789    Laptop     800        10
1  175  Tel칠fono     500        25
2  965    Tablet     300        15
3  215   Monitor     200        20
4  369   Teclado      50        50

In [11]:
df2 = pd.read_excel('Ejemplos/Tabla_2_ejemplo.xlsx')

df2

       CATEGOR칈A                FECHA      IMPORTE
0           Ocio  2024-01-07 00:00:00    $2.300,00
1   Supermercado  2024-02-07 00:00:00  $147.670,00
2           Ocio  2024-02-07 00:00:00   $59.183,00
3   Supermercado  2024-03-07 00:00:00   $15.000,00
4           Ocio  2024-06-07 00:00:00   $20.000,00
5           Ocio  2024-10-07 00:00:00    $3.500,00
6           Ocio  2024-11-07 00:00:00    $3.450,00
7           Ocio  2024-12-07 00:00:00   $31.558,00
8           Ocio  2024-12-07 00:00:00   $11.300,00
9   Gastos_Fijos             13/07/24    $7.095,00
10         Salud             13/07/24  $138.200,00
11  Supermercado             14/07/24   $40.000,00
12          Ocio             14/07/24   $30.000,00
13          Ocio             14/07/24    $6.400,00
14  Gastos_Fijos             14/07/24   $21.500,00
15          Ocio             15/07/24   $17.200,00
16          Ocio             15/07/24   $10.000,00
17         Salud             16/07/24   $87.315,00
18          Ocio             17/07/24    $9.000,00
19          Ocio             17/07/24    $4.000,00
20          Ocio             18/07/24   $22.500,00

## 游댌 Indexaci칩n de un DataFrame
Podemos acceder a los datos usando `loc[]` y `iloc[]`.

In [12]:
print(df.loc[0, 'Producto'])  # Acceder por etiqueta
print(df.iloc[1, 2])  # Acceder por 칤ndice

Laptop
500

In [13]:
print(df['Producto'])

0      Laptop
1    Tel칠fono
2      Tablet
3     Monitor
4     Teclado
Name: Producto, dtype: object

In [14]:
print(df['Producto'][2])

Tablet

## 游댝 Contar y sumar datos

In [15]:
print(df['Precio'].sum())  # Suma total de los precios
print(df['Precio'].mean())  # Promedio de precios

1850
370.0

### 游눹游닀 Pongamos a prueba nuestro conocimiento

Para que todo no se qued칠 con solo teoria, tratemos de resolver tres ejercicio para practicar (usaremos este link: https://www.online-python.com/)

1. Crea un DataFrame con los datos de cinco empleados: nombre, edad, salario y departamento.
2. Guarda un DataFrame en un archivo Excel y verif칤calo carg치ndolo de nuevo.
3. Calcula la media de los salarios y cuenta cu치ntos empleados hay en cada departamento.

## 游늳 Lectura y visualizaci칩n de datos

In [56]:
import numpy as np

data = {'Producto':['Carne','Lacteos', 'Verduras', 'Ropa'], 'Inventario':[4589, 854,np.nan,456], 'Ventas':[np.nan,698,214,np.nan]}
indices = ["Viaje_empresa_1","Viaje_empresa_2","Viaje_empresa_3","Viaje_empresa_4"]

tabla = pd.DataFrame(data = data, index = indices)
tabla

                 Producto  Inventario  Ventas
Viaje_empresa_1     Carne      4589.0     NaN
Viaje_empresa_2   Lacteos       854.0   698.0
Viaje_empresa_3  Verduras         NaN   214.0
Viaje_empresa_4      Ropa       456.0     NaN

In [57]:
print(tabla['Ventas'].sum())

912.0

In [58]:
tabla.stack()

Viaje_empresa_1  Producto         Carne
                 Inventario      4589.0
Viaje_empresa_2  Producto       Lacteos
                 Inventario       854.0
                 Ventas           698.0
Viaje_empresa_3  Producto      Verduras
                 Ventas           214.0
Viaje_empresa_4  Producto          Ropa
                 Inventario       456.0
dtype: object

In [59]:
print(tabla.info())  # Informaci칩n general del DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Viaje_empresa_1 to Viaje_empresa_4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Producto    4 non-null      object
 1   Inventario  3 non-null      float64
 2   Ventas      2 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes
None

In [60]:
print(tabla.describe())  # Estad칤sticas descriptivas

        Inventario      Ventas
count     3.000000    2.000000
mean   1966.333333  456.000000
std    2279.997003  342.239682
min     456.000000  214.000000
25%     655.000000  335.000000
50%     854.000000  456.000000
75%    2721.500000  577.000000
max    4589.000000  698.000000

### 游 Solucionar Problemas con Archivos
A veces, los datos en archivos pueden contener problemas como valores faltantes o formatos incorrectos.

In [61]:
#df = pd.read_csv('archivo.csv', na_values=['?', 'NaN', ''])
tabla.fillna(0, inplace=True)  # Reemplaza valores faltantes con 0

In [62]:
tabla

                 Producto  Inventario  Ventas
Viaje_empresa_1     Carne      4589.0     0.0
Viaje_empresa_2   Lacteos       854.0   698.0
Viaje_empresa_3  Verduras         0.0   214.0
Viaje_empresa_4      Ropa       456.0     0.0

In [49]:
print(tabla.info())  # Informaci칩n general del DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Viaje_empresa_1 to Viaje_empresa_4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Producto    4 non-null      object
 1   Inventario  4 non-null      float64
 2   Ventas      4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 128.0+ bytes
None

In [50]:
print(tabla.describe())  # Estad칤sticas descriptivas

       Inventario    Ventas
count     4.00000    4.0000
mean   1474.75000  228.0000
std    2105.28088  329.1727
min       0.00000    0.0000
25%     342.00000    0.0000
50%     655.00000  107.0000
75%    1787.75000  335.0000
max    4589.00000  698.0000

In [69]:
tabla.iloc[0, 2] = 587

In [70]:
tabla

                 Producto  Inventario  Ventas
Viaje_empresa_1     Carne      4589.0   587.0
Viaje_empresa_2   Lacteos       854.0   698.0
Viaje_empresa_3  Verduras         0.0   214.0
Viaje_empresa_4      Ropa       456.0     0.0